# TODO: Translation updated at 2026-06-20 16:57

# game/chapters/chapter_07.rpy:9
translate english chapter_07_7951ea86:

    # "Борис, казалось, крепко о чем-то задумался, молча вручил мне ключ от комнаты. Моё пожелание спокойной ночи выдернуло Бориса из задумчивости, и он покачал головой."
    ""

# game/chapters/chapter_07.rpy:11
translate english chapter_07_214e2bf2:

    # bb "Спокойно теперь не будет."
    bb ""

# game/chapters/chapter_07.rpy:13
translate english chapter_07_796c865f:

    # "Я не нашелся, что ответить и поднялся на второй этаж. Там было всего три комнаты, две из них теперь пустовали. Открыл дверь и невольно улыбнулся. Борис позаботился: на столе возле окна меня уже ждала стопка разномастной бумаги и несколько заточенных карандашей."
    ""

# game/chapters/chapter_07.rpy:15
translate english chapter_07_42a88986:

    # "Комната была совсем крошечной. В ней едва умещались кровать, стол, стул и одностворчатый шкаф, ни намека на уют, зато функционально. И занавески на железных зажимах скользили по карнизу бесшумно и не застревали. Хоть что-то в этом мире работало как надо."
    ""

# game/chapters/chapter_07.rpy:17
translate english chapter_07_614d3792:

    # "Я щелкнул кнопкой настольной лампы и сел. Желтый свет залил поверхность стола. Местами лак истончился, местами был исцарапан, но всё же стол выглядел лучше, чем тот, что был у меня дома."
    ""

# game/chapters/chapter_07.rpy:19
translate english chapter_07_c636668d:

    # "В тишине, с закрытой дверью и занавешенными окнами я почувствовал, как усталость и сонливость внезапно отступают. Внутри возник знакомый зуд — желание наконец переписать все обрывочные заметки из блокнота, упорядочить мысли и еще раз все перечитать."
    ""

# game/chapters/chapter_07.rpy:21
translate english chapter_07_df58e836:

    # "Так я и сделал."
    ""

# game/chapters/chapter_07.rpy:23
translate english chapter_07_469d78f5:

    # "Закончил уже далеко за полночь. Обессиленный, я разделся, аккуратно повесил одежду в шкаф и рухнул на постель. Уснул я мгновенно. Последней четкой мыслью было удивление от того, что простыни пахнут не хозяйственным мылом, а стиральным порошком. Мне казалось, что последняя пачка закончилась ещё до моего отъезда."
    ""

# game/chapters/chapter_07.rpy:25
translate english chapter_07_4132e40b:

    # "Этой ночью кошмары не снились, поэтому, проснувшись среди ночи, я не сразу понял, что меня разбудило."
    ""

# game/chapters/chapter_07.rpy:27
translate english chapter_07_05d1a0a2:

    # "За окном было тихо, полная луна светила в окно. Ветер из приоткрытой форточки слегка касался ажурного тюля, на него ложились причудливые тени от цветов."
    ""

# game/chapters/chapter_07.rpy:29
translate english chapter_07_2dc13dbb:

    # "Краем глаза я уловил движение у стола и вздрогнул, когда из тени показалась Лиза. Она села за стол и, не включая свет, начала читать. Только сейчас я заметил, что она держала большую пачку листов, удерживаемую двумя зажимами слева."
    ""

# game/chapters/chapter_07.rpy:31
translate english chapter_07_7e781122:

    # ll "«...и тогда Роб понял, что здесь и сейчас ему нужно сделать выбор между плохим и ужасным»."
    ll ""

# game/chapters/chapter_07.rpy:33
translate english chapter_07_7d7deedb:

    # "Она произносила слова медленно, смакуя каждый слог с той интонацией, которая всегда заставляла меня чувствовать себя дилетантом. Я резко сел на кровати."
    ""

# game/chapters/chapter_07.rpy:35
translate english chapter_07_909ce17f:

    # kb "Что ты здесь делаешь?"
    kb ""

# game/chapters/chapter_07.rpy:37
translate english chapter_07_3ba1311a:

    # "Голос подвел и прозвучал сипло. Лиза даже не подняла взгляд. Она взяла карандаш и зачеркивала отпечатанный текст."
    ""

# game/chapters/chapter_07.rpy:39
translate english chapter_07_441a876a:

    # "Я понял, что именно этот звук меня и разбудил. Лиза перевернула пару страниц, кончиками пальцев поглаживая край бумаги."
    ""

# game/chapters/chapter_07.rpy:41
translate english chapter_07_779477f6:

    # ll "А вот тут хорошо. «Вторая правда заключается в том, что из деревни нет выхода. Кругом Дремучий лес, Безымянное озеро не переплыть, а на болотах вас ждёт неминуемая погибель. Кажется, что всё безнадёжно, но…»"
    ll ""

# game/chapters/chapter_07.rpy:43
translate english chapter_07_35ec613b:

    # kb "Постой. Это… это моя рукопись?"
    kb ""

# game/chapters/chapter_07.rpy:45
translate english chapter_07_2fe65d42:

    # "Лиза наконец посмотрела на меня."
    ""

# game/chapters/chapter_07.rpy:47
translate english chapter_07_cfe00b8a:

    # ll "Это версия лучше, чем та, которую сжег Дед. И ты снова пишешь мою историю вместо того, чтобы наконец писать свою. Я вычеркнула лишнее. Можешь сказать спасибо."
    ll ""

# game/chapters/chapter_07.rpy:49
translate english chapter_07_fce46b99:

    # "Я встал, пошатываясь, и сделал шаг к ней."
    ""

# game/chapters/chapter_07.rpy:51
translate english chapter_07_ff9e3ccc:

    # kb "Откуда у тебя моя рукопись?"
    kb ""

# game/chapters/chapter_07.rpy:53
translate english chapter_07_e2bc210a:

    # ll "Ты мне её отдал."
    ll ""

# game/chapters/chapter_07.rpy:55
translate english chapter_07_36f46781:

    # "Она была спокойна и отвечала так, будто мы продолжали какой-то затянувшийся скучный разговор. В её глазах не было насмешки, не было стыда за то, что вот так ворвалась и…"
    ""

# game/chapters/chapter_07.rpy:57
translate english chapter_07_7f85808c:

    # kb "Как ты сюда попала?"
    kb ""

# game/chapters/chapter_07.rpy:59
translate english chapter_07_a3111362:

    # ll "Через дверь."
    ll ""

# game/chapters/chapter_07.rpy:61
translate english chapter_07_c38e81fc:

    # kb "Смешно. Тебя впустил Борис? Зачем ты пришла? Ты хоть знаешь, сколько сейчас времени?"
    kb ""

# game/chapters/chapter_07.rpy:63
translate english chapter_07_03e6788c:

    # ll "Полагаю, самое время тратить его на бессмысленные разговоры вместо того, чтобы обсудить текст?"
    ll ""

# game/chapters/chapter_07.rpy:65
translate english chapter_07_287d9f37:

    # kb "Обсудить? Что обсудить? Ты украла рукопись, которую я считал сгоревшей, и делаешь вид, что всё в порядке! Повторюсь: откуда она у тебя?"
    kb ""

# game/chapters/chapter_07.rpy:67
translate english chapter_07_49a9c74a:

    # ll "Я тебе уже ответила."
    ll ""

# game/chapters/chapter_07.rpy:69
translate english chapter_07_8a5ffcc8:

    # kb "Я не отдавал тебе ее."
    kb ""

# game/chapters/chapter_07.rpy:71
translate english chapter_07_47c91c37:

    # ll "Не отдавал или не помнишь, как отдавал?"
    ll ""

# game/chapters/chapter_07.rpy:73
translate english chapter_07_0570fdf9:

    # "Лиза поднялась со стула, не выпуская рукопись. Она двигалась бесшумно и точно. Она подошла вплотную, и от её взгляда внутри всё сжалось от ужасного предчувствия."
    ""

# game/chapters/chapter_07.rpy:74
translate english chapter_07_922c33ec:

    # "Сейчас. Вот сейчас она скажет это."
    ""

# game/chapters/chapter_07.rpy:76
translate english chapter_07_fed4f1c8:

    # "*разговаривают, Лиза ведет Владимира к амбару, тот спускается в подпол."
    ""

# game/chapters/chapter_07.rpy:77
translate english chapter_07_0eff944a:

    # "Слышит какие-то звуки, какой-то голос будто издалека и наваливается темнота."
    ""

