
# ГЛАВА 6

label chapter_06:
    
    show text "ГЛАВА 6\nТЕРЕМ" at truecenter with dissolve
    pause 2.0
    hide text with dissolve
 

    "Было глупо надеяться, что моё появление в “Тереме” останется незамеченнм и мне удастся молча отсидеться, не встревая в перепалки между Фросей и остальными. В том, что они будут не было сомнений."

    "Когда колокольчик над дверью звякнул, разговоры мгновенно прекратились и все хмуро уставились на меня."

    "Моё “приветствую всех” застряло где-то в горле. Я молча кивнул и направился вглубь зала, чтобы лишний раз не привлекать к себе внимание."

    "За столиками сидели почти все: дядя Миша как всегда был за стойкой, хлопотал над заказами. Волк со скучающим видом развалился на стуле и посматривал на дверь."

    "Аркадий один из немногих, кто приветливо кивнул мне в ответ, но от меня не укрылось, как сидевшая рядом Фрося недовольно ткнула его локтем. Видимо, я снова попал в немилость."

    "И только усевшись, я понял, какую ошибку допустил: за соседним столиком сидела Бабка. Исхудавшая, сгорбленная, укутанная в выцветший платок."

    "На меня она даже не посмотрела."

    "Внутри кафе царило напряжение. Кто-то всё ещё поглядывал на меня. Взгляд я не отводил."

    kb "Прости, что не зашёл к вам."

    "Бабка вздрогнула, медленно повернула голову. Я ожидал, что увижу покрасневшие глаза, но взгляд её был ясный, хоть и печальный."

    star "Дед о тебе спрашивал."

    "Это была не новость. Раньше я постоянно слышал “дед о тебе спрашивает”, “давно деда не навещал”, “дед совсем сдал” и каждый раз было осуждение в глазах."

    kb "а где он?"

    star "Ушёл на рассвете, всё ищет. На ту сторону сегодня пошёл. говорит, последняя надежда."

    kb "Не думаю, что Фрося будет в восторге от того, что он пропустит собрание."

    star "Сказал, что от разговоров толку мало."

    kb "Но одному на ту сторону ходить опасно, тем более возраст уже…"

    star "Он взял ружьё."

    "Я промолчал. Мы с Дедом явно видели разные опасности, которые могут быть на том берегу."

    "Оставалось надеяться, что Лиза не попадёт ему под горячую руку и не наговорит ему то, что может стоить ей жизни."

    menu:
        "Дед будет оберегать и защищать свою семью пока жив. Любой ценой. И если он хоть на минуту поверит, что за всем стоит Лиса… Ты знаешь что будет.":
            kb "ответ кота"

        "Пожалуйста, не делай из старика монстра. Не тронет он Лизу. Он в отчаянии, как и любой родитель. Он делает всё возможное, чтобы найти Колобка.":
            kb "ответ кота"

    "*Дед не успокоится, пока Колобок не будет найден. Он не сможет смириться с тем, что снова допустил ситуацию, где его ребенок пропал.*"

    novel "Влад зовёт сына, но тот не отзывается. Всего на минуту потерял из виду."

    "Большая тень накрыла стол и я поднял голову. Передо мной возвышался Борис."

    bb "– Рад, что ты пришёл."

    "Он подсел ко мне и кивнул Михаилу, тот с добродушной улыбкой положил передо мной лист меню, тщательно заламинированный скотчем. Большие аккуратные буквы, выведенные как по линейнке, старательно отрисованные изображения блюд – за что бы ни брался дядя Миша, делал он это основательно, не довольствуясь простым “сойдет”."

    "Наверное во всей деревне только “Терем” и сохранил свой прежний облик и, если не присматриваться, то будто бы за эти годы ничего и не изменилось: всё те круглые столики под клеёнками в клетку, расположенные в шахматном порядке, те же люстры с вычищеными плафонами."

    "И пахло тоже как раньше: жареными пирожками."

    bb "Миш, дай нам по “Сливушке”, будь добр."

    mm "ох, так закончилась же. Митька на днях последнюю забрал. Из крепкого только самогон, но вы не по этой части. Да и его осталось пара бутылей, воды чистой не добудешь сейчас."

    bb "ну тащи тогда чай твой, только мёд не клади мне."

    mm "да я и не смог бы, была последняя кадушка, но пустая теперь. Видимо я выскреб всё по зиме спросонья и забыл. Так что мёду нету. А чай принесу, может даже крепкий получится, как ты любишь."

    "Когда дядя Миша отошел от нашего стола, Борис вытащил из кармана стопку блокнотов и придвинул их ко мне. Все они явно были исписанны, я видел, что некоторые страницы разбухли от сырости."

    bb "На складе нашел. Видимо, ты забыл в прошлый раз."

    "Хоть я и постарался не подавать виду, но всё же не смог скрыть своё удивление."

    "Я открыл первый блокнот и застыл, глядя на первую заметку."

    bb "ты в порядке? выглядишь будто я тебе подсунул змею, а не бумажки твои."

    kb "просто… я искал их везде. Спасибо, что вернул."

    "Было странное ощущение будто я балансирую у обрыва."
    "Один порыв ветра –  ты летишь  прямиков в бездну и черт знает, что тебя там ждет."
    "Я будто почувствовал, как внутри прорывается какая-то плотина, ещё немного и стена пойдёт трещинами. И не укрыться, не спастись от того, что хлынет оттуда."
    bb "А ты что скажешь? Ты в это веришь?"
    "Я пропустил половину речи Фроси, но общий смысл был понятен: общими усилиями мы сможем вернуть всё, как было раньше. Колобок будет найден, дома отстроены заново, против черноптиц сделаем ловушки и пугала."
    kb "Cомневаюсь."

    "Бык как будто был рад услышать моё мнение."

    "Фрося продолжала раздавать указания, но на этот раз энтузиазма в глазах собравшихся не было."

    sf "Так, далее… для Симы Ильинична я тут написала на бумажке, передайте ей, пожалуйста..."

    "Фрося умолкла."

    "Я как и все в зале начал оглядываться. Симы Ильиничны не было."

    sf "Волк, ты заходил к ней вчера? Проверял всё ли в порядке?"

    vv "Да, в вечерний обход заходил. Дверь заперта. Я подумал, что она опять к Бабке ушла и не стал бить тревогу."

    star "Да что ей делать у нас? Она давно уже не заходит к нам. С тех пор, как пропала… как пропал…"

    zm "Лиса вчера мимо её дома проходила, я видел."

    "В зале наступила тишина. Меня не удивило, что никто не обратил внимание, что Симы Ильиничны в кафе нет, так было всегда. Она всегда была тихая, незаметная. И всё же её исчезновение настораживало."

    kb "Фрося, ты вчера сказала, что видела Симу Ильиничную."

    sf "Дык когда ж это было! неделю, а то и больше неазад… Потом же её кто-нибудь ещё видел.Кто её видел вчера? А позавчера?"

    "Никто не видел Симу уже неделю."

    sf "Это что ж получается-то? И наша Сима… пропала?"

    "Фрося подтянула к себе стул и опустилась на него, растерянно глядя на нас, будто ждала, что её переубедят. Пропажа ещё одного жителя явно не входила в ее планы “сделать всё, как было раньше”."

    kb "Расскажи, что было, когда ты её видела в последний раз?"

    sf "Она… она выглядела нервно. Очень. Набирала крупу в лавке, сухари, консервы. Целую гору нагребла. Я б её спросила куда ей столько, но она ж всё равно не слышит. Но мне не жалко, раз ей спокойнее так, то пусть запасается."

    bb "пусть запасается?"

    "Стул с громким скрипом отъехал назад и Борис встал, недобро глядя Фросю."

    sf "Боря, не начинай. Что ты опять. Всё идёт по плану. Стройка. Поиски. Что-нибудь и с пропитанием придумаем. Я вон новую партию посадила, авось чего и взойдет. Не пропадём."

    bb "Какой план, Фрося? Ты вообще понимаешь, что происходит? Урожай на полях сгнил за неделю. Запасов еды на неделю-другую хватит. По-твоему, всё в порядке? Ты это Владимиру расскажи, когда он в новый дом заезжать будет — что жрать ему придется древесные опилки."

    sf "Это временные трудности! Найдется Колобок и тогда всё наладится! А пока надо просто потерпеть, что ты как маленький."

    bb "Как оно наладится? Объясни мне, пожалуйста. Как Колобок нам поможет, а?"

    sf "Как-как… Будто не знаешь. Он нам унывать не дает, видел бы ты сейчас себя. Нюни развесил! Вы все! Что вы сидите и глазками своими хлопатете? Думате, вам одним тут тяжело? Думаете, меня не беспокоит, что еды осталось мало? Вы хоть помните, откуда она у вас? Я! Я её сажаю, сею, удобряю и вам, неблагодарные такие, отдаю. За просто так! А вы что?"

    bb "Да речь не об этом!"

    "Бык двинулся вперед и, встав напротив Фроси, уже спокойнее проговорил."

    bb "Я не об этом говорю. Я говорю о том, что ты всё ждёшь Колобка, будто от того, что он появится, мы станем жить легче…"

    sf "Но это так!"

    bb "Нет. Оглянись, Фрося. Все вы посмотрите, во что превратилась наша деревня? И ведь всё это началось еще до того, как Колобок пропал. Только мы ничего не замечали. Всё разваливается."

    "Борис обвел каждого тяжелым взглядом, не позволяя отмахнуться от его слов."

    sf "Ой, ну что ты заладил-то. Всё мы замечали, но что тут поделаешь, раз всё ломается. Что можно починить, то чиним, а что нет… Бабка вон позвонит своим в город, они сюда Стёпку отправят, больно хорошо он в механизмах разбирается."

    bb "Телефон стоит у магазина, хоть кто-нибудь за последние годы проверял его? Нет. А я сегодня проверил. Не работает. И хрен знает, с каких пор. Насос в колодце сломался, соляры нет. Генератор сегодня трижды глох."

    sf "Всё привезут из города!"

    "Фрося сорвалась на крик. Её и без того красное лицо побагровело."

    sf "А не привезут, я сама сяду на электричку и привезу! Так что не надо такое говорить! Всё будет хорошо! Ты посмотри, что ты наделал? Ты их напугал! И ради чего?!"

    kb "Фрося, он прав."

    "Все перевели взгляд на меня."

    "я чувствовал гул в ушах, в висках стучало. Бездна приближалась, а вместе с ней и воспоминания."

    sf "что ты там бормочешь? Неужели голос прорезался? Хочешь что-то сказать, так говори громче. Расскажи всем, как покрываешь Лизу вместо того, чтобы искать Колобка! Неделю! Неделю уже здесь торчишь и всё без толку!"

    kb "Ты не сможешь уехать."

    sf "ты слышишь, что я тебе говорю вообще, а? Не смогу уехать… ха! Ещё как могу!"

    ga "Фрося, да послушай ты его!"

    "Тут уже не выдержал Гусь. Он тоже поднялся."

    ga "дай ему договорить, пожалуйста. Я не понимаю, что происходит… Владимир, Боря, то, что вы говорите… правда?"

    kb "Поезда не ходят. Станция разрушена. Пути заросли кустарником высотой в человеческий рост. Платформа почти ушла под трясину. Болото разрастается."

    "В кафе воцарилась мертвая тишина. Фрося открыла рот, но не смогла произнести ни звука."

    kb "Я несколько дней назад был там, искал Колобка, наткнулся на неё и…"

    "Перед глазами возникло воспоминание: платформа, разрушенная и заброшенная."

    "Не обращая внимание на дальнейшую ругань, я снова сел за стол и один за другим открывал блокноты, пока не нашел то, что искал."

    novel "“На пероне, Влад держит за руку Ваню, который машет вслед уходящему поезду. Они не знают, что ждет их впереди. написать, что возвращаться было ошибкой, что люди не меняются. И всё же горе всех объединило.”"

    "Я отчётливо помнил, как делал эту заметку. Вид разрушенной станции меня так поразил, ведь я был уверен, что с ней ничего не случилось. Я помню, что даже не сразу понял, что вышел к станции. Я вышел из леса и просто брел среди высокой травы, ботинки то и дело проваливались в мох и трясину. А потом я увидел остаток платформы. Ту часть, которая еще оставалась на поверхности."

    "Но вместе с тем, я помнил и то, как стоял на пероне, смотрел вслед поезду и сжимал свой дорожный чемодан."

    "Как я ни крутил, картинка не складывалась,детали соединялись, но будто были из разных наборов. Всё было нелогично."

    "В этот момент дверь «Терема» с грохотом распахнулась. На пороге стоял Дед. Его одежда была перепачкана тиной, лицо искажено яростью. Одной рукой он сжимал ружьё, другой — волок за шиворот Лису. Она не сопротивлялась, вид у неё был отстраненный, если не скучающий."

    "Дед толкнул её в центр зала, прямо к Фроси и Борису. Лиса выпрямилась и улыбнулась Фросе самой вежливой улыбкой, какую только можно представить."

    "Дед хрипло дышал, сжимарь ружьё и все с опаской смотрели, не рискуя подойти ни к Лисе, ни к Деду. Бабка осталась сидеть и только покачала головой, когда Дед ткнул пальцем в Лису."

    st "Уберите её от меня, иначе… "

    "Он осекся, его голос дрогнул."

    st "Я нашёл Колобка. Он был в амбаре, на той стороне. Ранен. И она рядом!"

    "*продолжение следует"
 
    jump chapter_07

    