

label chapter_04_editorial_office:

    show text "ГЛАВА 4\nРедакция" at truecenter with dissolve
    pause 2.0
    hide text with dissolve

    "На рассвете я вышел из дома Фроси и побрел по деревне." 

    novel "Дымка от пепелища саваном укутывала деревню.{w} Яблони стояли будто стражи мертвого королевства: коряво-костлявые ветви чернели после ночного дождя, а оставшиеся с прошлой осени скукожившиеся плоды болтались на черенках как черепушки мелких зверей на ниточках.{w} Зловещим был не только вид заброшенного сада, но и запах, который тянулся с болот, смешивался с гарью и оседал на мшистых заборах и покосившихся калитках."
    
    "Даже в такой ситуации я не мог перестать видеть образы."


    show office
    "Было мучительно без возможности тут же записать слова."
    "Порой моя голова настолько переполнялась идеями, что готова была взовраться. Это были по-настоящему опасные периоды, в которые я не всегда мог отличить реальность от вымысла."
    "Как в тот раз, когда Петух вытащил меня из реки. Я как безумный рвался к воде, пытался убедить его, что меня кто-то зовёт, что мне нужно кого-то спасти. Что я могу изменить историю."
    "Я этого не помнил."
    "Когда пришел в себя, невыносимо болела голова и если бы не Колобок, который сразу же примчался поддержать меня, я бы…"
    "Пусть воспоминаний о том дне почти и не осталось, то страх остался. Первобытный, какого я не испытывал ни до, ни после, даже в тех повторяющихся кошмарах о спящем голодном чудовище."
    "Я боялся того, что мне привиделось. Боялся, что каким-то непостижимым образом моя галлюцинация станет явью."
    "Что же я такое увидел? Кто или что звало меня со дна?"
    "Долгое время я пытался разгадать тайну того зова, но тщетно."
    "Казалось, чем ближе я подхожу к пониманию, тем сильнее меня отбрасывает назад."
    "Я не спал и не ел. Много пил. Никому не было дела до моих творческих мук, кроме Колобка. Каждое утро приходил ко мне в редакцию, садился рядом и напевал одну из тех песенок, от которой всегда становилось легче."
    "Его присутствие помогло мне: из обрывочных заметок и размышлений о том приступе родился мой второй роман."
    "Если верить Лизе, то я почти написал третий. Но в кабинете не было ни следа черновиков. Впрочем, с чего им тут быть? После закрытия газеты я тут редко появлялся, кабинет меня больше не вдохновлял."
    "Я так хотел написать ещё что-то стоящее, но выходило жалкое подобие детских страшилок."
    "Какие-то ведьмы, колодцы, полные скелетов... Да ожившее чучело, которое поет детские песенки, заставляя всех топиться в реке."
    "Всё не то."
    "Где-то там, в глубине подсознания, таилась истинная история, но мне никак не удавалось вытащить её наружу."
    "Неужели я правда писал что-то такое? Но почему не помню?"
    "И почему, зная, что всё сгорело, я не чувствую ужаса и отчаяния?"

    menu:
        "Потому что рукопись не сгорела, её не было в доме":
            "Она точно должна быть там. Где же ей ещё быть? Здесь-то её тоже нет. Только если я не унёс её. Но какой смысл уносить? Чтобы — что?"
            

        "Просто там не было ничего стоящего, очередная чушь...":
            "Не хочется признавать, но очень похоже на правду. И всё же... Зачем Лиза так сказала?"

    "Голос молчал."        
    "Что вообще я хотел здесь найти? Только впустую потратил время. "
    "Перед отъездом я заходил сюда лишь для того, чтобы пополнить запас карандашей и блокнотов. Нужно было как можно чаще разгружать голову от идей." 
    "Всё же не хотелось окончить свои дни, захлебнувшись в теперь уже грязной и воняющей болотом реке. Да и друга, который может прийти и спасти, уже не было."
    "Петух, Толик, Колобок…"
    "Было предчувствие, что на этом список не закончится. Что-то явно происходило вокруг: черноптицы, ненастье, пожары, жители…"
    "Если бы я был суеверным как Фрося, тоже решил бы, что какая-то ведьма прокляла деревню. Вот бы знать за что."
    "Наивное желание, но так хотелось, чтобы всё было как раньше." 
    "Писать статьи про строительство “Терема”, чтобы самой большой проблемой было уговоривать деда сфотографироваться с репой, выращенной на конкурс урожая."
    "Вечером сидеть в рюмочной с Петухом и Колобком. А по выходным я бы писал что-нибудь спокойное."
    "Возможно ли это вернуть, если я найду Колобка?"

    menu:
        "Ну разумеется! Колобок был тем, кто помогал всем нам жить счастливо. Он жив, ты это знаешь и его нужно поскорее вернуть, пока она не довела дело до конца.":
            "Ты про Лизу? Может Фрося права и мне стоит серьезно поговорить с ней? В конце концов, от Лизы и правда можно чего угодно ожидать."

        "Можно, но зачем? Ты же и сам чувствуешь, что вся эта деревенская идиллия осталась в прошлом. Даже если Колобок вернется, ты уже не сможешь жить как раньше. Ты не сможешь притворяться, что счастлив.":
            "Да конечно, я вижу, во что превратилась деревня и жители. Всё умирает, тонет в смраде болот и унынии. Я не хочу быть частью этого. Найду Колобка и уеду отсюда как можно дальше."

    "Тихий полумрак редакции угнетал. Пыль толстым слоем лежала на всех поверхностях, кроме пустого стола. Наверное кто-то приходил в моё отсутствие. Но кто? И зачем?"

    "Ещё вопросы, которые, судя по всему, останутся без ответа."
    "От вопросов снова раскалывалась голова, и спасти положение могла только припрятанная где-то в кабинете «Сливушка»."
    "Но куда же я ее положил?"
    
    
    jump editorial_office_searching

    
