
label chapter_07:
    
    show text "ГЛАВА 7\nЗабвение" at truecenter with dissolve
    pause 2.0
    hide text with dissolve
    

    "Борис, казалось, крепко о чем-то задумался, молча вручил мне ключ от комнаты. Моё пожелание спокойной ночи выдернуло Бориса из задумчивости, и он покачал головой."

    bb "Спокойно теперь не будет."

    "Я не нашелся, что ответить и поднялся на второй этаж. Там было всего три комнаты, две из них теперь пустовали. Открыл дверь и невольно улыбнулся. Борис позаботился: на столе возле окна меня уже ждала стопка разномастной бумаги и несколько заточенных карандашей."

    "Комната была совсем крошечной. В ней едва умещались кровать, стол, стул и одностворчатый шкаф, ни намека на уют, зато функционально. И занавески на железных зажимах скользили по карнизу бесшумно и не застревали. Хоть что-то в этом мире работало как надо."

    "Я щелкнул кнопкой настольной лампы и сел. Желтый свет залил поверхность стола. Местами лак истончился, местами был исцарапан, но всё же стол выглядел лучше, чем тот, что был у меня дома."

    "В тишине, с закрытой дверью и занавешенными окнами я почувствовал, как усталость и сонливость внезапно отступают. Внутри возник знакомый зуд — желание наконец переписать все обрывочные заметки из блокнота, упорядочить мысли и еще раз все перечитать."

    "Так я и сделал."

    "Закончил уже далеко за полночь. Обессиленный, я разделся, аккуратно повесил одежду в шкаф и рухнул на постель. Уснул я мгновенно. Последней четкой мыслью было удивление от того, что простыни пахнут не хозяйственным мылом, а стиральным порошком. Мне казалось, что последняя пачка закончилась ещё до моего отъезда."

    "Этой ночью кошмары не снились, поэтому, проснувшись среди ночи, я не сразу понял, что меня разбудило."

    "За окном было тихо, полная луна светила в окно. Ветер из приоткрытой форточки слегка касался ажурного тюля, на него ложились причудливые тени от цветов."

    "Краем глаза я уловил движение у стола и вздрогнул, когда из тени показалась Лиза. Она села за стол и, не включая свет, начала читать. Только сейчас я заметил, что она держала большую пачку листов, удерживаемую двумя зажимами слева."

    ll "«...и тогда Роб понял, что здесь и сейчас ему нужно сделать выбор между плохим и ужасным»."

    "Она произносила слова медленно, смакуя каждый слог с той интонацией, которая всегда заставляла меня чувствовать себя дилетантом. Я резко сел на кровати."

    kb "Что ты здесь делаешь?"

    "Голос подвел и прозвучал сипло. Лиза даже не подняла взгляд. Она взяла карандаш и зачеркивала отпечатанный текст."

    "Я понял, что именно этот звук меня и разбудил. Лиза перевернула пару страниц, кончиками пальцев поглаживая край бумаги."

    ll "А вот тут хорошо. «Вторая правда заключается в том, что из деревни нет выхода. Кругом Дремучий лес, Безымянное озеро не переплыть, а на болотах вас ждёт неминуемая погибель. Кажется, что всё безнадёжно, но…»"

    kb "Постой. Это… это моя рукопись?"

    "Лиза наконец посмотрела на меня."

    ll "Это версия лучше, чем та, которую сжег Дед. И ты снова пишешь мою историю вместо того, чтобы наконец писать свою. Я вычеркнула лишнее. Можешь сказать спасибо."

    "Я встал, пошатываясь, и сделал шаг к ней."

    kb "Откуда у тебя моя рукопись?"

    ll "Ты мне её отдал."

    "Она была спокойна и отвечала так, будто мы продолжали какой-то затянувшийся скучный разговор. В её глазах не было насмешки, не было стыда за то, что вот так ворвалась и…"

    kb "Как ты сюда попала?"

    ll "Через дверь."

    kb "Смешно. Тебя впустил Борис? Зачем ты пришла? Ты хоть знаешь, сколько сейчас времени?"

    ll "Полагаю, самое время тратить его на бессмысленные разговоры вместо того, чтобы обсудить текст?"

    kb "Обсудить? Что обсудить? Ты украла рукопись, которую я считал сгоревшей, и делаешь вид, что всё в порядке! Повторюсь: откуда она у тебя?"

    ll "Я тебе уже ответила."

    kb "Я не отдавал тебе ее."

    ll "Не отдавал или не помнишь, как отдавал?"

    "Лиза поднялась со стула, не выпуская рукопись. Она двигалась бесшумно и точно. Она подошла вплотную, и от её взгляда внутри всё сжалось от ужасного предчувствия."
    "Сейчас. Вот сейчас она скажет это."

    "*разговаривают, Лиза ведет Владимира к амбару, тот спускается в подпол."
    "Слышит какие-то звуки, какой-то голос будто издалека и наваливается темнота."

    
    jump chapter_08