
# ГЛАВА 4-5

# --- ЛОКАЦИЯ: РЕДАКЦИЯ ---

label chapter_editorial_office:

    if chosen_chapter_ambar_first:
        # Так как амбар был первым, сейчас идет Глава 5 (Редакция)
        show text "ГЛАВА 5\n[chapter_5_title]" at truecenter with dissolve
        pause 2.0
        hide text with dissolve

   
    "Было мучительно без возможности тут же записать слова."
    "Порой моя голова настолько переполнялась идеями, что готова была взовраться. Это были по-настоящему опасные периоды, в которые я не всегда мог отличить реальность от вымысла."
    "Как в тот раз, когда Петух вытащил меня из реки. Я как безумный рвался к воде, пытался убедить его, что меня кто-то зовёт, что мне нужно кого-то спасти. Что я могу изменить историю."
    "Я этого не помнил."
    "Когда пришел в себя, невыносимо болела голова и если бы не Колобок, который сразу же примчался поддержать меня, я бы…"
    "Пусть воспоминаний о том дне почти и не осталось, то страх остался. Первобытный, какого я не испытывал ни до, ни после, даже в тех повторяющихся кошмарах о спящем голодном чудовище."
    "Я боялся того, что мне привиделось. Боялся, что каким-то непостижимым образом моя галлюцинация станет явью."
    "Что же я такое увидел? Кто или что звало меня со дна?"
    "Долгое время я пытался разгадать тайну того зова, но тщетно."
    "Казалось, чем ближе я подхожу к пониманию, тем сильнее меня отбрасывает назад."
    "Я не спал и не ел. Много пил. Никому не было дела до моих творческих мук, кроме Колобка. Каждое утро приходил ко мне в редакцию, садился рядом и напевал одну из тех песенок, от которой всегда становилось легче."
    "Его присутствие помогло мне: из обрывочных заметок и размышлений о том приступе родился мой второй роман."
    "Если верить Лизе, то я почти написал третий. Но в кабинете не было ни следа черновиков. Впрочем, с чего им тут быть? После закрытия газеты я тут редко появлялся, кабинет меня больше не вдохновлял."
    "Я так хотел написать ещё что-то стоящее, но выходило жалкое подобие детских страшилок."
    "Какие-то ведьмы, колодцы, полные скелетов... Да ожившее чучело, которое поет детские песенки, заставляя всех топиться в реке."
    "Всё не то."
    "Где-то там, в глубине подсознания, таилась истинная история, но мне никак не удавалось вытащить её наружу."
    "Неужели я правда писал что-то такое? Но почему не помню?"
    "И почему, зная, что всё сгорело, я не чувствую ужаса и отчаяния?"

    menu:
        "Потому что рукопись не сгорела, её не было в доме":
            "Она точно должна быть там. Где же ей ещё быть? Здесь-то её тоже нет. Только если я не унёс её. Но какой смысл уносить? Чтобы — что?"
            

        "Просто там не было ничего стоящего, очередная чушь...":
            "Не хочется признавать, но очень похоже на правду. И всё же... Зачем Лиза так сказала?"

    "Голос молчал."        
    "Что вообще я хотел здесь найти? Только впустую потратил время. "
    "Перед отъездом я заходил сюда лишь для того, чтобы пополнить запас карандашей и блокнотов. Нужно было как можно чаще разгружать голову от идей." 
    "Всё же не хотелось окончить свои дни, захлебнувшись в теперь уже грязной и воняющей болотом реке. Да и друга, который может прийти и спасти, уже не было."
    "Петух, Толик, Колобок…"
    "Было предчувствие, что на этом список не закончится. Что-то явно происходило вокруг: черноптицы, ненастье, пожары, жители…"
    "Если бы я был суеверным как Фрося, тоже решил бы, что какая-то ведьма прокляла деревню. Вот бы знать за что."
    "Наивное желание, но так хотелось, чтобы всё было как раньше." 
    "Писать статьи про строительство “Терема”, чтобы самой большой проблемой было уговоривать деда сфотографироваться с гигантской репой, выращенной на конкурс урожая."
    "Вечером сидеть в рюмочной с Петухом и Колобком. А по выходным я бы писал что-нибудь спокойное."
    "Возможно ли это вернуть, если я найду Колобка?"

    menu:
        "Ну разумеется! Колобок был тем, кто помогал всем нам жить счастливо. Он жив, ты это знаешь и его нужно поскорее вернуть, пока она не довела дело до конца.":
            "Ты про Лизу? Может Фрося права и мне стоит серьезно поговорить с ней? В конце концов, от Лизы и правда можно чего угодно ожидать."

        "Можно, но зачем? Ты же и сам чувствуешь, что вся эта деревенская идиллия осталась в прошлом. Даже если Колобок вернется, ты уже не сможешь жить как раньше. Ты не сможешь притворяться, что счастлив.":
            "Да конечно, я вижу, во что превратилась деревня и жители. Всё умирает, тонет в смраде болот и унынии. Я не хочу быть частью этого. Найду Колобка и уеду отсюда как можно дальше."

    "Тихий полумрак редакции угнетал. Пыль толстым слоем лежала на всех поверхностях, кроме пустого стола. Наверное кто-то приходил в моё отсутствие. Но кто? И зачем?"

    "Ещё вопросы, которые, судя по всему, останутся без ответа."
    "От вопросов снова раскалывалась голова, и спасти положение могла только припрятанная где-то в кабинете «Сливушка»."
    "Но куда же я ее положил?"
    
    jump editorial_office_searching

    
label on_the_table:

    "Сердце тревожно заколотилось."
    "Странный лист, в самом верху вопрос “имя??” плотно исписанный именами. На полях слово “сестра”."
    "Я знал, что это. Так я обычно расписывался, пытаясь найти имена для героев. Бывало, на поиски уходил не один час, пока среди десятков слов не находилось то самое, от которого вдруг образы разгорались будто сухие ветки от искры. Так было со Златой в рассказе “Скорлупка”."

    "Разница лишь в том, что я обычно помнил, как искал имена. Эту страницу я видел впервые. В этом я был уверен. Как и в том, что почерк — мой."
    "Это уже точно не простая забывчивость и не эффект от выпитой “Сливушки”. Я был трезв уже три дня, с тех самых пор, как приехал."
    "Мысли опять разозленными осами гудели в голове, я бросился в подсобку за карандашом."
    "Нужно было всё запи…"
    jump podsobka

label podsobka:
    scene black
    "*подсобка*" 
    "А это здесь откуда?"
    "Между стенкой и шкафом был втиснут стол, на котором громоздилась пишущая машинка."
    "Рядом с ней стоял стакан с белесым, засохшим осадком ликёра на дне. Вокруг валялись блокноты и кучка изгрызенных карандашей. Тут же лежал и мой перочинный нож — на лезвие прилипли крошки от графита."
    "Я здесь был. Судя по всему, провел здесь часы, изводя бумагу и опустошая ту самую бутылку. Но я точно знал: за все три дня с момента возвращения я и близко не подходил к редакции."
    "Я медленно опустился на стул. В каретке пишущей машинки белел лист с отпечатанным текстом."

    novel "Деревню эту знают все.{w} Знают, кто живёт здесь, знают кто с кем водится, а кого на дух не переносит.{w} Но вот, что интересно, никто не знает, где она находится и есть ли у неё название.{w} Есть. {w}И мой вам совет никогда не забывать его.{w} Вы можете возразить, что слушать мёртвого мальчика глупо, но ведь только я знаю правду о том, что здесь происходит."

    "Мысли заметались в голове с новой силой, виски заломило, я ухватился за край стола, пытаясь читать дальше."
    "Но с каждым словом реальность опять раздваивалась, разлеталась, переплеталась и снова множилась, и вот я уже не читатель, а писатель."
    "Глоток ликёра, клавиши дробно стучат, выбивая букву за буквой. Здесь и сейчас рождается истинная история. В полумраке подсобки, за закрытой на ключ дверью. Чтобы никто не помешал, чтобы никто не увидел."
    novel "И вот вам первая правда: меня не существует.{w} Я умер тридцать лет назад, мои кости надежно укрыты илом и никто на всём белом свете не помнил про меня.{w} До недавнего времени."
    "Лишь бы успеть дописать, пока я всё ещё помню."
    "Лишь бы она передумала, ведь должен быть другой способ заставить его замолчать…"
    "Лишь бы…"
    "Судорога прошлась по конечностям, скрюченные пальцы царапали клавиши, стараясь дотянуться, дописать еще чуть-чуть, но…"
    "Навалилась тьма, моё тело грохнулось со стула и в следующий миг я потерял сознание."

    "*очухивается и идет к амбару*"
     
    hide screen office_hover_screen
    scene black

    jump chapter_ambar_second

label meet_Mitya:
    # Сцена встречи
    scene editorial_office 
    "Я только взял бутылку, как тут же появился Митя. Он еле стоял на ногах."
    kb "Да у тебя потрясающее чутье."
    "Я не смог сдержаться, но он всё равно ничего не понял."
    

    zm "Вот ты… где. А я тебя ищу. Искал. А ты тут. Прячешься."

    kb "Я не прячусь. Я ищу рукопись."

    zm "Ну да. Ты же писатель. Пишешь."

    kb "Ты что-то хотел?"

    zm "Поговорить нам с тобой надо. Серь… Серьезно, понимаешь?"

    "Разговаривать серьезно с пьяным Митей мне совершенно не хотелось, надо было его вежливо спровадить."

    kb "Я с радостью тебя выслушаю, но давай не сейчас."

    zm "Сейчас! Мы поговорим сейчас!"

    "Митя схватил со стола мой перочинный нож и наставил на меня."

    zm "Ты выслушаешь меня! Вы… выслушаешь! Не то я… Не то я тебя…"

    kb "Ладно, хорошо. Я понял. Давай серьезно поговорим. Только присядем, хорошо? Я сейчас возьму те два стула, мы сядем и спокойно поговорим. Договорились?"

    "Митя кивнул, опуская нож обратно на стол."

    zm "Прости, я не хотел. Просто все вы… Никто не воспринимает меня всерьез. Я же говорил всем, что так будет. Что она не изменится. Мне так страшно."

    "Митя заметил бутылку на столе и, не спрашивая, тут же допил остатки «Сливушки»."

    zm "Мне всё время страшно. Вдруг она снова придет. Вдруг и этот дом…"
    zm "Я… знаешь, вчера пьяный был, а сегодня мне Борис рассказал, ночью видел, как загорелся твой дом. Молния шарахнула."
    zm "А я и не слышал. Он мне рассказывает, а я только и думаю, что зря я испугался и сразу к тебе не пришел. Может если бы ты знал, то и не было бы ничего этого."

    "Слушать пьяную речь Мити было сложно."

    kb "Погоди. Переведи дыхание. К чему ты это всё говоришь?"

    zm "Предупредить тебя хочу! Не верь Лизе."
    zm "Помнишь, как она меня выгнала из дома? Ей сошло с рук. Петуха вместе с домом спалила! Ей и это с рук сошло. Да даже Волка… Ох, ну ты знаешь, его хвост. Тоже никто ничего не сказал." 
    zm "Колобок пропал, твой дом сго..сгорел. А ей хоть бы что. Я ее сегодня видел на том берегу, никто туда не ходит. Что-то замышляет опять. Надо ее остановить!"

    "Митя вскочил и покачнулся."

    zm "Ой, меня сейчас…"

    "Договорить он не успел, метнулся к мусорной корзине в углу, и его вывернуло. Только сейчас я заметил, что в мусорке были какие-то бумажки. Оставалось надеяться, что ничего важного."

    scene black with dissolve
    jump chapter_06