

label chapter_04_ambar:

    show text "ГЛАВА 4\nАмбар" at truecenter with dissolve
    pause 2.0
    hide text with dissolve

    "Я быстрым шагом дошел до реки. Там, за гниющим настилом моста начиналась территория, которую все предпочитали обходить стороной."
    "Но это, конечно же, не касалось Лизы - я заметил её, уходящую прочь от Амбара."
    "Не похоже было, что она искала Колобка."
    "Сам не знаю почему, но я не окликнул её, дождался, когда она скорет из виду."
    "Наверное стоило проследить за ней, но она бы вычислила меня на раз, и пришлось бы на ходу прдумывать оправдание, в которое она, само собой, ни на секунду не поверила бы."
    "Для верности выждал ещё пару минут я продолжил путь."

    "Мир по ту сторону тонул в тяжелом, влажным смраде, доносимым с болот."
    "Я замер на мосту, не смея переступить границу междумирья. Именно так это ощущалось. Мир живых, который неспешно пробуждался, начинался новый день, полный повседневных забот и тревог. Мне не хотелось быть его частью. Но и к миру призраков я тоже не решался присоединиться. Да, призраки тут были повсюду."
    "Не в прямом смысле, конечно."
    "Оказавшись на той стороне, я замедлил шаг: воображение, а может далекое воспоминание из детства, встало перед глазами."
    "Вместо высокой перепутанной травы и давно заросших тропинок, я видел жилые дома, ухоженные дворы и свежепокрашенные в голубой калитки. Широкая проселочная дорога, ямы, присыпанные щебнем, сколоченная кем-то скамейка у первого дома."
    "И жители решили не восстанавливать эти дома после того страшного урагана?"
    "Я пошел к амбару."
    "Виденье разрухи меркло, вытесняемое туманом, сквозь который, словно на фотографии, постепенно проявлялись разрушенные дома, проржавевший «Запорожец», садовая тачка с ржавым дном."
    "Домовой знак на доме покосился, козырек и сам круг с цифрой пошел ржавыми пятнами, цифры облупились так, что едва можно было прочесть. Но я помнил. Речная улица, дом один."
    "Здесь раньше жили старики. Это был наш дом, ещё до появления Колобка."
    "Тогда всё было по-другому."

    menu:
        "Жаль, что они так и не смирились с утратой, тогда всё могло бы быть иначе. Пытаясь вернуть, они потеряли намного больше, тебе так не кажется?":
            kb "Опять говоришь загадками. Я в эти игры не играю. Если есть, что сказать – говори прямо или молчи. От твоих слов у меня каждый раз начинает болеть голова."

        "Что ни делается – всё к лучшему. Если бы не случившиеся, у них бы не появился Колобок. Любить и заботиться о нем – вот их истинное счастье. Так что не медли, найди его.":
            kb "А я что по-твоему делаю? Но не ради них. Уж точно не ради Деда. Я просто хочу найти друга, живым и невредимым."

    "Я гнал мысль о том, что всё может плохо закончиться. Не хотел бы стать тем, кто сообщит старикам ужасную новость."
    "Я бы предпочел, чтобы кто-нибудь другой нашел Колобка, привёл его домой, и пока все радовались бы, я собрал чемодан и сел на первый поезд."
    "Надеюсь, что они ходят всё так же часто, кажется, за последние сутки я не слышал гудков. В любом случае, ждать на вокзале лучше, чем видеть лицо Бабки, когда я откажусь праздновать воссоединение семьи. Если, конечно, у меня хватит духа отказаться."
    "Как я ни старался, совсем вычеркнуть их из своей жизни не получалось. Пусть сейчас я и избегал их, но проведенное в их доме детство вспоминалось с теплотой. И всё же благодарность за то, что приютили, имела границы."
    "Я не разговаривал с Дедом уже много лет. И хотел бы не общаться с ним впредь. Некоторые поступки невозможно простить, а он даже не извинялся."
    "Но надо было осмотреть амбар, хотя я даже не знал, что мне искать. Следы? Улики? Тело?"
    "Внутри пахло прелым сеном, пометом и пыльной мешковиной. Среди нагромождения деревянных ящиков, пустых ведер и прогрызенных мешков с прогорклым зерном было тесно и неуютно."
    
    jump ambar_searching
