
label chapter_10:
    
    show text "ГЛАВА 10\nИзбушка Лисы" at truecenter with dissolve
    pause 2.0
    hide text with dissolve
    
    label scene_workshop_investigation:

    "Лиса допытывается. Больше не получится воспользоваться Колобком, значит, Владимир должен вспомнить сам."
    
    "Она ставит перед ним машинку."

    ll "Ты должен написать."

    "В тексте она хочет уловить, что случилось с Аленушкой (истинную причину расследования она всё ещё скрывает). Она замечает, что Владимир всё время пишет про какого-то мальчика."
    
    "Вокруг — куча записей на доске. Это улики, факты и тд"
    "Лиса проговаривает, что знает, но всё равно много неясного."
    "Голоса помогают соединить фрагменты воедино."

    "*тут будет интерактив наверное*"

    ll "Забудь о поисках Колобка, забудь обо всём остальном. Если понять, что произошло с Алёнушкой, то всё станет понятно."
    ll "Есть пятнадцать улик, но только девять ведут к разгадке — это правда. Всё остальное — вымысел. Ты должен вспомнить."
    ll "Сейчас главное не «почему», а «как». Как пропали все жители? Что объединяет всех пропавших? Кто видел их в последний раз?"

    "Они спорят с Лизой; у той слишком много вопросов. Владимир садится и пишет. Лиза тут же читает, делая пометки и вычеркивает ненужное. Она как никто знает все его книги, она изучала много лет."

    "В какой-то момент Лиза его прерывает."

    ll "Вот тут. Ты описываешь какой-то сарай, тайный ход… Это может быть правдой?"

    "Владимир говорит с Голососами"
    
    "На закате они выходят из лесу и осторожно идут к мастерской." 
    "Они видят, что идёт дым из трубы бани, но пахнет не деревом, а горелым хлебом."


    jump chapter_11