label chapter_11:
    
    show text "ГЛАВА 11\nМастерская" at truecenter with dissolve
    pause 2.0
    hide text with dissolve

    "Дверь в мастерскую открыта, они вбегают и плотно закрывают ее."
    "Темно. Запах горелого хлеба и опилок."

    "Владимиир с Лизой переговариваются. Она рада, что тот наконец начал вспоминать."

    kb "Но почему нельзя было с самого начала рассказать?"

    ll "Я собиралась, но ты начал меня допрашивать и подозревать. И это после того, как я тебе доверилась и всё рассказала."

    kb "Но я же этого не помнил!"

    "Лиза проигнорировала."

    jump masterskaya_searching

    

   

    "Ход не из мастерской, а из их старого дома."

    return

    jump masterskaya_searching
