
label chapter_12:
    
    show text "ГЛАВА 12\nЛИХО" at truecenter with dissolve
    pause 2.0
    hide text with dissolve
    
   

    label chapter_swamp_final:

    "Путь по подземному ходу казался бесконечным: своды то и дело опасно проседали, осыпаясь на плечи влажными комьями, а под ботинками хлюпала вязкая, дурно пахнущая жижа."

    "Воздух был застойным, явно отдающим болотом, приходилось дышать через раз."

    "Через минуту впереди показался свет."

    "Я выбрался наружу, раскидав ветки от выхода, и помог Лизе, благосклонно принявшей мою подставленную ладонь. Откуда только эти аристократические замашки…"

    "Деревня осталась позади. Сквозь плотное переплетение ветвей можно было разглядеть край крыши амбара."
    "Впереди был только густой и мрачный лес. Никакой тропы мы не заметили, и нам не оставалось ничего другого, кроме как двинуться прямиком в дремучую чащу."

    "Не прошло и десяти минут, как лес начал меняться, будто мы пересекли ту самую границу между лесом и болотом."
    "Почва стала неровной, ноги оплетала осока, скрывающая вязкую жижу. Ботинки то и дело соскальзывали с мокрых кочек, и каждый шаг сопровождался чавкающим звуком."

    "Тут и там торчали замшелые коряги, поваленных деревьев становилось больше, а следов животных и пения птиц — меньше."
    "Запоздало пришла мысль, что надо было отмечать путь, чтобы не заблудиться. Местность откровенно начала настораживать. Словно я оказался в одном из своих кошмаров. Для пущего эффекта только не хватало…"
    "Ох, чёрт."

    kb "Лиза, вот там, около яблони…"
    ll "Ты про бревно? Да они тут на каждом… Ох."
    kb "Да."

    "Дикая яблоня, засохшая, с облезлым стволом, раскинула свои голые ветви и стояла то ли как маяк, то ли как напоминание о том, что некогда здесь была плодородная почва."
    "То ли как могильный памятник."

    ll "Не повезло бедняге. Ему надо было смотреть, куда…"
    kb "Ей. Кажется, это женщина, волосы длинные."

    "Тело наполовину ушло в землю, а то, что осталось на поверхности, было словно в гнезде из переплетения склизких корней. Лиза нахмурилась и двинулась к яблоне."

    kb "Вряд ли из деревни кто-то случайно сюда забрел. Только если… Погоди, что ты делаешь? Лучше не лезь туда! Провалишься!"
    ll "Помоги мне!"
    kb "Твою ж."

    "Я в жизни не представлял, что однажды буду вытаскивать труп из болота."

    "От спокойствия Лизы не осталось и следа. Она пыхтела, вытягивая тело покойницы. Я вцепился в остатки ремня на теле и тоже потянул изо всех сил. Ботинки скользили по черной жиже."

    "Я старался не обращать внимания на то, что поневоле трогаю холодную и задубевшую от долгого пребывания в торфе кожу мертвеца."

    ll "Ну же!"

    "Болото чавкнуло, испуская пузыри зловонного газа, и неохотно отпустило свою добычу."
    "Тело вышло на поверхность рывком, тяжелое, словно мешок с сырым песком. Это даже трупом сложно было назвать, скорее мумией."
    "Зачем Лизе понадобилось вытаскивать ее, я не знал, но мелькнувшая догадка заставила присмотреться к телу женщины."

    "Платье наверняка когда-то было ярким, но теперь побурело и по большей части сгнило. В распахнутом вороте виднелась пергаментного вида кожа, но никаких бус или цепочек не было. Волосы отдавали рыжиной, но, может, всё дело было в торфе."

    "Пряжка ремня заржавела и с одной стороны раскрошилась, когда я пытался вытянуть тело. Если обувь и была, то осталась где-то в жиже."

    kb "Ты знаешь, кто это?"

    "Лиза молчала. Присев на корточки, она потрогала ремень, затем волосы и внезапно резким движением погрузила пальцы в вонючую жижу."

    "Стряхнув грязь и обтерев находку о платье женщины, Лиза рассматривала красную пластмассовую пуговицу в виде розы."

    kb "Я даже не заметил…"
    ll "Ты просто не знал."

    "Лиза поднялась и, храня всё то же непривычно серьёзное выражение лица, вернулась к тропе."
    "От привычного леса не осталось и следа, вокруг, насколько хватало глаз было болото."

    ll "Мда. Какое дивное место мы выбрали, чтобы закончить свой бесславный путь к правде."

    kb "Это просто болото."
    ll "Жуткое болото, ты хотел сказать?"

    "Слева зеленела безмолвная топь, из которой, словно костлявые руки, торчали остовы черных деревьев."
    "Клочья тумана лениво ползли по поверхности застоявшейся воды. Справа всё было в кочках и заросло осокой, над которой метались стрекозы. От лаза вниз шла тропка по рыхлой, но вроде бы надежной почве."

    "Я отыскал две крепкие на вид палки, и мы двинулись, проверяя плотность земли перед собой. Чем дальше мы продвигались, тем реже попадались сухие островки, размытый чернозем перемежался с ямами, наполненными мутной водой."

    "Мы шли в полном молчании и лишь обменивались взглядами, когда замечали следы присутствия других людей. Ботинок, ржавый топор и кости, которые встречались всё чаще."
    "В отличие от той мумии, которая сохранилась благодаря торфу, этих несчастных явно постигла худшая участь, чем просто утонуть в болоте."

    kb "У меня плохое предчувствие. Ты уверена, что хочешь идти дальше со мной?"
    ll "Поверь, тебе понадобится любая помощь. И смею тебя уверить, ты удивишься, на что я способна, если вопрос касается жизни и смерти."

    "Как часто бывало, за этой фразой чувствовалось что-то еще, и на этот раз я решил не игнорировать. Хватит с меня недосказанности."

    kb "Постой. Прежде чем мы придем туда… куда мы идем, я хочу, чтобы ты рассказала всё, что знаешь. Всё, что по тем или иным причинам скры…"

    "Лиза дернулась, намереваясь обойти меня."

    ll "Нашел время, чтобы…"

    kb "Да постой же. Я верю, что про Алёнушку ты рассказал всё, что знаешь. Но ведь есть что-то еще, верно?"
    kb "Ты говорила, что просто пыталась понять, куда делись дети... Допустим."
    kb "Но та записка? И эта женщина в болоте? Прости, конечно, Лиза, но ты не из тех, кто вытаскивает трупы из трясины ради чистого любопытства."
    kb "Я готов спорить на что угодно: ты прекрасно поняла, кто там лежит."

    "Лиза хмыкнула, напустив на себя привычный равнодушный вид, но ее рука метнулась в карман, где лежала пуговица."

    ll "Тебе не кажется, что сейчас не время для допросов. Скоро солнце сядет. Так что, если ты не возражаешь, перенесем нашу светскую беседу на потом."

    kb "А ты уверена, что будет «потом»? Ты знаешь, куда ведет эта тропа? Что мы там найдем? Почему-то мне кажется, что ты знаешь ответы. Но я понять не могу, почему скрываешь. Ты используешь меня с какой-то целью. Может, наконец расскажешь?"

    ll "Когда кажется, советуют…"

    kb "Лиза. Пожалуйста. Мне надо знать."

    "Лиза замерла. Её плечи опустились, и она долго стояла неподвижно, глядя в сторону уходящей тропы. Когда она наконец повернулась, взгляд её был спокойный и открытый."

    ll "Ты прав. Я тебя использую. Надеюсь, тебе стало легче от моего признания."

    kb "Да хватит уже! Оглянись! Мы стоим посреди вонючего болота, повсюду кости и недавно, напомню, мы наткнулись на труп. Люди тут умирали, и мы, возможно, следующие. Нам не справиться поодиночке. Если так получилось, что мы оказались здесь вместе, то должны быть в одной команде. Я тебе не враг."
    
    kb "Я на твоей стороне!"
    
    "Может потому, что я выдержал долгий взгляд Лизы, может потому, что она и сама понимала, что скрывать становится опасным для нас обоих, но после паузы она заговорила лишенным всяких эмоций голосом."

    ll "В детстве... люди пропадали часто. Списывали на болото, на несчастные случаи. Мои родители пропали. Кто-то сказал, что они меня бросили, потому что я... Никто не любит детей, с которыми сложно."

    "Она достала пуговицу и покрутила ее."

    ll "То платье... Мама сама его шила, я сидела рядом и смотрела, как она пришивает эти дурацкие пуговицы. Розочки."

    "Лиза подняла на него глаза, полные отчаянной решимости."

    ll "Я иду туда, Владимир, потому что хочу знать правду. Что с ними случилось? Как они там оказались? Я должна это увидеть."

    "*еще разговаривают*"
    "Мы двинулись дальше строго друг за другом. Ботинки уввязали в трясине и пару раз палка почти наполовину ушла в болото. Передвигаться стало опаснее."
    "Размышления Владимира о прошлом, о родителях Лизы и о ее судьбе в целом."
    "Неожиданно нога ступила что-то твердое и сквозь грязь я разглядел грубо сколоченный настил из досок."
    "Кто-то проложил дорогу, судя по состоянию древисины довольно давно."

    kb "Как думаешь, чьих рук дела?"

    "В ответ тишина. Лизы рядом не было."
    "Владимир зовет ее, думает не вернуться ли, но в конечном счете продолжает свой путь вперед."

    "Я стоял в десятке шагов от мрачного вида хижины."
    "*описание местности, колышка, бороздок на стене и тд"

    "Передо мной была дверь, за которой так или иначе всё должно было закончиться."

    "Я потянул на себя проржавевшую ручку и шагнул в темноту."

    "В нос ударил затхлый запах, смешанный с вонью тины и давно немытого тела. В нескольких шагах от меня послышалось какое-то копошение."

    "Фонарик я не решился доставать. Да и память, теперь кристально ясная, подкидывала образы чудовища, которое здесь обитает уже много… лет? Веков?"

    "У меня не было плана, о чём я тут же пожалел. Мысль отыскать наконец Алёнушку затмевала все рациональные «как же, чёрт побери, её отсюда вытащить»?"

    "Глаза привыкли к темноте, и сквозь проникающий сквозь щели свет я разглядел комнату."

    "Полусгнившие доски пола местами утопали в сырой земле, в одном углу было что-то вроде лежанки или огромного гнезда из веток и мха."
    "На этой импровизированной кровати лежала бледная девушка с длинными спутанными волосами. Подол летнего платья был изорван, обнажая худую и не менее бледную босую ногу."

    "Я силился расслышать дыхание или заметить движение грудной клетки, но не получалось. Я скользил взглядом по стенам и полу до самого темного угла."

    "Костлявая великанша смотрела на меня своим единственным глазом, лишенным век."

    "Вот и всё. Сейчас бросится и сожрет неудачника-героя, который с чего-то решил, что спасет в одиночку Алёнушку из-под носа Лихо."

    "Я перевел взгляд ниже, чтобы удостовериться, что у людоедки есть нос. Он имелся: большой, чуть скособоченный, ноздри раздувались, с каждым выдохом выпуская хриплое и зловонное дыхание."

    liho "Ты."

    "Вопроса в голосе я не услышал, поэтому промолчал."
    "Очень кстати я заметил несоразмерно длинные руки, которые оканчивались костлявыми пальцами с длинными загнутыми ногтями. Или когтями — это как посмотреть."
    "В любом случае, Лихо хватило бы одного резкого прыжка ко мне, чтобы разодрать мне грудь своими когтями и вырвать сердце. Воображение во всех красках рисовало мою незавидную кончину."

    "Но великанша не шевелилась, всё так же сверля меня взглядом."

    "Я рискнул сделать шажок в сторону Алёнушки. Ничего."

    "Я сделал еще один. Всё то же выжидающее безмолвие."

    "Разрешает, тварь. О причинах я не думал."

    "Вблизи Алёнушка оказалась ещё хуже: синева под глазами и бескровные губы, дыхание слабое и прерывистое."

    "Я оглянулся на Лихо."

    liho "Моя."

    "Стараясь не делать резких движений, я едва коснулся руки Алёнушки, как великанша бросилась вперед и мощным толчком отшвырнула меня к стенке, после чего встала, загораживая свою жертву. Рычала."

    "Я поднялся, держась за ребра. Каждый вдох отзывался болью, сердце колотилось как бешеное. Великанша стояла оскалившись, руки чуть разведены в стороны, готовые схватить, если я снова попытаюсь приблизиться. Но что если…"

    "Я снова рванулся вперед, низко прижимаясь к полу. Хотел проскочить под её длинными, как ветви старой ивы, руками. Лихо даже не шелохнулось — лишь в последний момент костлявая ладонь накрыла меня сверху, прижимая к сырым доскам."

    liho "Моя."

    "Я вывернулся, длинные ногти разодрали кожу на затылке и прошлись по плечу, вспоров рубашку, но зато я оказался у неё за спиной и что есть силы оттолкнул её в сторону."
    "Великанша покачнулась, отступая, но не упала, как я надеялся. Но этой секундной заминки мне хватило, чтобы схватить Алёнушку и броситься к двери."

    "Лихо развернулось со сверхъестественной скоростью и с диким ревом бросилось на меня. Она вырвала у меня Алёнушку и снова отшвырнула к стене. Бросила всё еще находящуюся в бессознании Алёнушку на лежанку и двинулась на меня, сверкая глазами и ощерившись гнилыми зубами."

    "Зловонное дыхание донеслось до меня, когда великанша опустилась на четвереньки и приблизила ко мне лицо, всё в язвах и с клочками волос, свисающих по обе стороны."

    "Это конец. Это должен быть конец."

    "Но ничего не происходило. Только если эта тварь не решила и меня оставить в качестве полудохлой мышки, с которой можно еще поиграть."

    "Ну уж нет. Не дав себе времени передумать, я всем телом врезался в нее и наконец-то повалил великаншу на спину. Из чернеющей пасти вырвался хрип, который можно было расценить как удивленный. Прыжок, еще один. Я снова поднял Алёнушку."

    "Совсем близко раздался рык."
    "Голова взорвалась оглушительной болью, в глазах померкло, и я, не выпуская едва теплое тело Алёнушки, осел на сырую землю и потерял сознание."

    "Она меня не убила."
    "Очнулся на том же месте, рядом с лежанкой Алёнушки. Великанша наблюдала за моими попытками подняться из того же темного угла. Я потрогал висок, куда пришелся удар, прикосновение отозвалось болью. Рана на затылке, наливающийся синяк на виске, царапина на плече, но все конечности целы."

    "Почему она не убивает меня? Она могла бы раздавить меня одним движением, но лишь отталкивает. Снова и снова."

    "Я не смогу забрать Алёнушку. Хоть было страшно оставлять ее здесь, но один я не справлюсь. Нужна подмога. И дедово ружье не помешает. Хотя бы для того, чтобы припугнуть тварь."

    "Стараясь не стоять к великанше спиной, я чуть развернулся, чтобы убедиться, что Алёнушка за то время, что я валялся в обмороке, не умерла. Дыхание было слабым, но равномерным. Будто она… спит."

    liho "Моя."

    "Я вздрогнул, великанша неслышно подобралась ко мне и встала рядом. Руки свисали вдоль ссутулившегося тела."

    "Прошла минута, затем вторая. Мы так и стояли друг против друга. Страх отступал, на его месте возникла озадаченность, граничащая с неловкостью."

    "Я медленно отошел от лежанки и спиной двинулся к двери. Великанша смотрела, как я на ощупь открыл дверь и уже собирался уйти. Она меня отпускала. Я и правда ей не нужен. Ни в каком виде."

    "Я замер в дверях, соображая, как поступить дальше. Пытаться забрать Алёнушку у меня не получится, тут и гадать не надо. Но пока я буду ходить за подмогой, кто знает, что она сделает с Алёнушкой."

    "Зачем она вообще ее тут держит полуживую? Насколько я мог судить, Алёнушка невредима. Я не понимал."

    "И во всей этой ситуации не мог не задаваться одним вопросом."

    kb "Почему ты не нападаешь на меня?"

    liho "Не человек."

    kb "Питаешься только человечиной, ха?"

    "Ох, зря я это сказал. Если что-то и было способно выдать мой страх и нервозность, так это неуместные шутки. Оставалось надеяться, что великанша не из обидчивых."

    liho "Не ем. Собираю. Внутри. Когда плохо, то хорошо. Ты другой. Ты поможешь…"

    "Может, показалось, но последняя фраза прозвучала как вопрос."

    "*продолжение следует"

    jump chapter_13