
label chapter_06_ambar:

    show text "ГЛАВА 6\nАмбар" at truecenter with dissolve
    pause 2.0
    hide text with dissolve
    show bridge
     
    "Я быстрым шагом дошел до реки. Там, за гниющим настилом моста начиналась территория, которую все предпочитали обходить стороной."
    "Мир по ту сторону тонул в тяжелом, влажным смраде, доносимым с болот."

    zm "Т-ты… ты где был-то, а? Владимир?"

    "Я вздрогнул и обернулся: никак не ожидал, что встречу кого-то здесь. Из-за кустов, неуклюже цепляясь за ветки, выбирался Митя. Его пошатывало, взгляд скользил по мне, но никак не мог остановиться. Сомнений не было — он пьян в стельку."

    zm "Я ж эт-самое… искал тебя. В редакцию стучал, думал, ты там заперся, строчишь чего… А там зак… закрыто. Фрося Федоровна сказала, что ты рано ушёл."

    kb "Что ты здесь делаешь?"

    zm "Я? А! Я это… наблюдаю. Кто-то ж должен… бдеть. Она ушла, но вернется, точно тебе говорю. Вернется. Там где-то прячется…"

    "Митя махнул в сторону темнеющего леса, едва не потеряв равновесие."

    kb "Иди домой, Мить. Поспи. Сюда никто не ходит."

    zm "Так ты ж… ты ж пришел. Ты вот зачем пришел сюда? Ты мне только правду скажи, я никому не скажу."

    "Он стоял, пытаясь сфокусироваться на мне, выглядел при этом словно побитая собака, которой протягиваешь кусок котлеты: боязно подходить близко, но так хочется снова довериться."

    kb "Я ищу Колобка. Может, он провалился куда или застрял, надо всё проверить."

    zm "Ну да… Колобка… Т-ты знаешь, я ж всей душой хочу тебе поверить, Вов. Чес-слово, пытаюсь… но голова-то, она соображает."
    zm "Странное это сов… сов-па-дение. Сперва Лиза там шастает, теперь вот ты пришел. Мне Фрося Федоровна всё рассказала… что вы с Лизой… это… что ходит она к тебе."
    zm "Аркадий Иваныч врать не станет, он видел."

    menu:
        "И этот туда же. Надо им дать понять, что ты на их стороне, иначе тоже станешь персоной нон-грата.":
            kb "Ты меньше их слушай. Мы с Лизой даже не друзья. Мне тоже кажется подозрительным её поведение. Спрошу её об этом, если увижу."

        "Будто сговорились. Нашли на кого повесить. Такими темпами мировые войны, инфляцию и черт знает еще что повесят на нее.":
            kb "Может она тоже Колобка ищет! Что вы все накинулись на Лизу? Я понимаю, что она не очень-то любезна со всеми, но голословно обвинять… Успокойся. Я с ней поговорю, уверен, есть вполне достойное объяснение, почему она тут была."

    zm "Честно? Ты только не верь ей сразу, прошу тебя, не верь. Она ж… она ж с тобой так же сделает. Как со мной… как с Волком. Не хочу, чтобы и тебе она навредила."

    kb "Обещаю. А теперь иди, тебе надо отдохнуть. И постарайся не пить больше. По крайней мере сегодня."

    "Он пытался сфокусироваться на мне, после чего кивнул и побрел домой. Я смотрел, как он уходит — сгорбленный, подавленный и явно измученный страхом. Прошло столько лет с того скандала вокруг его домика, но он до сих пор боялся Лизу."

    "Впрочем, я его не виню. Лиза всегда была сама по себе и делала то, что ей хотелось. Что ей нужно было на заброшенной части, я не знал, но это было чертовски подозрительно. Пожалуй, мне и правда стоит её отыскать и поговорить."

    "Я замер на мосту, не смея переступить границу междумирья. Именно так это ощущалось. Мир живых, который неспешно пробуждался, начинался новый день, полный повседневных забот и тревог. Мне не хотелось быть его частью. Но и к миру призраков я тоже не решался присоединиться. Да, призраки тут были повсюду."
    "Не в прямом смысле, конечно."
    "Оказавшись на той стороне, я замедлил шаг: воображение, а может далекое воспоминание из детства, встало перед глазами."
    "Вместо высокой перепутанной травы и давно заросших тропинок, я видел жилые дома, ухоженные дворы и свежепокрашенные в голубой калитки. Широкая проселочная дорога, ямы, присыпанные щебнем, сколоченная кем-то скамейка у первого дома."
    "И почему жители решили не восстанавливать эти дома после того страшного урагана?"
    "Я пошел к амбару."
    hide bridge
    show saray_dark
    "Виденье разрухи меркло, вытесняемое туманом, сквозь который, словно на фотографии, постепенно проявлялись разрушенные дома, проржавевший «Запорожец», садовая тачка с ржавым дном."
    "Домовой знак на доме покосился, козырек и сам круг с цифрой пошел ржавыми пятнами, цифры облупились так, что едва можно было прочесть. Но я помнил. Речная улица, дом один."
    "Здесь раньше жили старики. Это был наш дом, ещё до появления Колобка."
    "Тогда всё было по-другому."

    menu:
        "Жаль, что они так и не смирились с утратой, тогда всё могло бы быть иначе. Пытаясь вернуть, они потеряли намного больше, тебе так не кажется?":
            kb "Опять говоришь загадками. Я в эти игры не играю. Если есть, что сказать – говори прямо или молчи. От твоих слов у меня каждый раз начинает болеть голова."

        "Что ни делается – всё к лучшему. Если бы не случившиеся, у них бы не появился Колобок. Любить и заботиться о нем – вот их истинное счастье. Так что не медли, найди его.":
            kb "А я что по-твоему делаю? Но не ради них. Уж точно не ради Деда. Я просто хочу найти друга, живым и невредимым."

    "Я гнал мысль о том, что всё может плохо закончиться. Не хотел бы стать тем, кто сообщит старикам ужасную новость."
    "Я бы предпочел, чтобы кто-нибудь другой нашел Колобка, привёл его домой, и пока все радовались бы, я собрал чемодан и сел на первый поезд."
    "Надеюсь, что они ходят всё так же часто, кажется, за последние сутки я не слышал гудков. В любом случае, ждать на вокзале лучше, чем видеть лицо Бабки, когда я откажусь праздновать воссоединение семьи. Если, конечно, у меня хватит духа отказаться."
    "Как я ни старался, совсем вычеркнуть их из своей жизни не получалось. Пусть сейчас я и избегал их, но проведенное в их доме детство вспоминалось с теплотой. И всё же благодарность за то, что приютили, имела границы."
    "Я не разговаривал с Дедом уже много лет. И хотел бы не общаться с ним впредь. Некоторые поступки невозможно простить, а он даже не извинялся."
    "Но надо было осмотреть амбар, хотя я даже не знал, что мне искать. Следы? Улики? Тело?"
    hide saray_dark
    "Внутри пахло прелым сеном, пометом и пыльной мешковиной. Среди нагромождения деревянных ящиков, пустых ведер и прогрызенных мешков с прогорклым зерном было тесно и неуютно."

   
    jump ambar_searching

label ambar_end:
    "Я стоял, не зная, что я ищу. И всё же... Чувство, что я что-то упускаю не исчезало."
    "Мне нужно было отыскать мои блокноты. Если их нет в редакции и они не сгорели, то я даже не знад  , где искать."
    "Усталось наваливалась и я побрел к Борису, надеюсь, он позволит переночевать в его доме."

    hide screen ambar_search_screen
    hide scene bg_ambar_light_secret
    scene black


    jump chapter_07
